import os
import time

CSI = "\x1b["
ZERO = f'{CSI}1G'
ERASE = f'{CSI}2K'
R = f'{CSI}0m'
up = f'{CSI}20A'
red = 9
white = 15
black = 0
green = 10
yellow = 11
blue = 12
colors = [red, green, yellow, blue, black]
# Просто вводные данные

def draw(color, leng):
    lengp = ' ' * leng
    filled = f'{CSI}48;5;{color}m'  # Цвет
    return (f'{filled}{lengp}')  # Полоска leng длины


def nx():
    print()


#       1  2  3  4  5  6  7  8  9  0  1  2
crc = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1] + [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1][::-1],
       [0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1] + [0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1][::-1],
       [0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0] + [0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0][::-1],
       [0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0] + [0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0][::-1],
       [0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0] + [0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0][::-1],
       [0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0] + [0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0][::-1],
       [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0] + [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0][::-1],
       [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0] + [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0][::-1],
       [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] + [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0][::-1],
       [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] + [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0][::-1], ]

circ = crc + crc[::-1]  # Строим скелет узора


def dcirc(rep, clr, fon):
    for i in range(0, 20):
        for _ in range(rep * 2):
            for j in circ[i]:
                if j == 1:
                    print(draw(clr, 1), R, end='')  # Закрашиваем ровно 1 символ
                else:
                    print(fon, R, end='')  # Закрашиваем ровно 1 символ
        print()  # Переход на следующую строку

def wcirc(leng):
    n = 0
    while True:
        time.sleep(0.8)
        os.system('cls')
        dcirc(leng, colors[n % 5], ' ')
        n += 1



if __name__ == '__main__':
    wcirc(2) # Если взять длину больше - рисунок ломается,
